Revit 2027 API
FabricSheet.IsBent Property
 The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBent { get; }
Public ReadOnly Property IsBent As Boolean
	Get
public:
property bool IsBent {
	bool get ();
}
member IsBent : bool with get
Property Value
Boolean
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace